// Напишите программу, которая принимает на вход цифру, 
// обозначающую день недели, и проверяет, является ли этот день выходным.
// 6 -> да 
// 7 -> да 
// 1 -> нет

int num = new Random().Next(1, 8);
if ((num == 6) || (num == 7))
{
    System.Console.WriteLine($"{num} -> {"да"}");
}
else
{
    System.Console.WriteLine($"{num} -> {"нет"}");
}